app/channels/application_cable/connection.rb

      def find_verified_user
        # or however you want to verify the user on your system
        client_id = request.params[:client]
        verified_user = User.find_by(email: client_id)
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]