app/controllers/bookings_controller.rb

  def new
    authorize! :create, Booking
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def refund
    @booking = Booking.find(params[:id])
    if @booking.refund_payment
      post = Post.find(@booking.post_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @booking = current_user.bookings.build(booking_params)
    num_pers = params[:booking][:num_pers].to_i
    @booking.num_pers=num_pers
    post = Post.find(@booking.post_id)

    if post.persone_rimanenti > 0
      if @booking.save_with_payment
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "post_id", "created_at", "updated_at", "stripe_charge_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["post_id", 3], ["created_at", "2023-05-13 15:47:53.350791"], ["updated_at", "2023-05-13 15:47:53.350791"], ["stripe_charge_id", nil]]
UPDATE "posts" SET "updated_at" = ?, "persone_rimanenti" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-05-13 16:25:08.361390"], ["persone_rimanenti", 5], ["id", 3]]