app/controllers/conversations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1001], ["LIMIT", 1]]
---
    def show
        #Controlliamo se tale conversazione già esiste
        if session[:current_conversation]
            @conversation = Conversation.find(session[:current_conversation])
        end
        #Cerchiamo gli utenti della conversazione
        @current_user = current_user
        @guide_user = User.find_by(email: params[:guide_email])

        if !@conversation
            @conversation = Conversation.between(@current_user.id,@guide_user.id).first