app/controllers/guide_users_controller.rb

    def update_location
        current_user.update(lat: params[:lat], long: params[:lng])
---
UPDATE "users" SET "updated_at" = ?, "lat" = ?, "long" = ? WHERE "users"."id" = ?  [["updated_at", "2023-05-13 10:36:15.710783"], ["lat", "41.2532948"], ["long", "13.5960013"], ["id", 8]]