app/controllers/pages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role_id" = ? AND (LOWER(users.name) LIKE '%m%')  [["role_id", 10]]
SELECT "users".* FROM "users" WHERE "users"."role_id" = ? AND "users"."name" = ?  [["role_id", 10], ["name", "Mario Reda"]]
SELECT "users".* FROM "users" INNER JOIN "languages_users" ON "languages_users"."user_id" = "users"."id" INNER JOIN "languages" ON "languages"."id" = "languages_users"."language_id" WHERE "users"."role_id" = ? AND (LOWER(users.name) LIKE '%j%') AND (languages.name LIKE '%e%')  [["role_id", 10]]
SELECT "languages".* FROM "languages" INNER JOIN "languages_users" ON "languages"."id" = "languages_users"."language_id" WHERE "languages_users"."user_id" = ?  [["user_id", 3]]
---
    def guides
        @guides = User.where(role_id: 10)
        nome = params[:nome]
        citta = params[:citta]
        linguaggio=params[:linguaggio]
        nazione=params[:nazione]
        # Modifica la variabile @guides in base agli input del form (nome e citta)
        if nome.present?
          @guides = @guides.where("LOWER(users.name) LIKE ?", "%#{nome.downcase}%")
        end
        if citta.present?
          @guides = @guides.joins(:city).where("LOWER(cities.name) LIKE ?", "%#{citta.downcase}%")
        end
        if linguaggio.present?
          @guides = @guides.joins(:languages).where("languages.name LIKE ?", "%#{linguaggio}%")