app/controllers/posts_controller.rb

  def index
    citta = params[:citta]
    lingua = params[:lingua]
    if (citta.present? && lingua.present?)
      @posts = Post.where("nomeC LIKE ?", "%#{params[:citta]}%")
      @posts = @posts.where("lingua LIKE ?", "%#{params[:lingua]}%")
    elsif (!citta.present? && lingua.present?)
      @posts = Post.where("lingua LIKE ?", "%#{params[:lingua]}%")
    elsif (citta.present? && !lingua.present?)
      @posts = Post.where("nomeC LIKE ?", "%#{params[:citta]}%")
    else
      @posts = Post.all
    end
    @posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE (nomeC LIKE '%Roma%')
SELECT "posts".* FROM "posts" WHERE (nomeC LIKE '%Roma%') AND (lingua LIKE '%Ita%')
SELECT "posts".* FROM "posts" WHERE (lingua LIKE '%T%')
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("descrizione", "titolo", "data", "ora", "lingua", "persone", "prezzo", "nomeC", "regioneC", "nomeP", "created_at", "updated_at", "numero_ore", "persone_rimanenti", "user_email", "user_id", "address") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    persone_to_subtract = params[:post][:persone].to_i
    if @post.persone_rimanenti >= persone_to_subtract
      @post.persone_rimanenti -= persone_to_subtract
      if @post.save
---
UPDATE "posts" SET "updated_at" = ?, "persone_rimanenti" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-05-11 22:00:13.209105"], ["persone_rimanenti", 5], ["id", 3]]

  def get_price
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def all
    @posts = Post.all
---
SELECT "posts".* FROM "posts"