app/models/booking.rb

INSERT INTO "bookings" ("user_id", "post_id", "created_at", "updated_at", "stripe_charge_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["post_id", 3], ["created_at", "2023-05-13 15:47:53.350791"], ["updated_at", "2023-05-13 15:47:53.350791"], ["stripe_charge_id", nil]]
---
  def refund_payment
    return false unless stripe_charge_id.present?

    charge = Stripe::Charge.retrieve(stripe_charge_id, { stripe_account: post.user.stripe_account_id })

    if charge
      puts charge
      refund = Stripe::Refund.create({
        charge: charge.id,
        refund_application_fee: true,},
        stripe_account: post.user.stripe_account_id
      )

INSERT INTO "bookings" ("user_id", "post_id", "created_at", "updated_at", "stripe_charge_id", "refunded", "num_pers") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def generate_invoice_pdf
    template = ERB.new(File.read("#{Rails.root}/app/views/invoices/invoice.html.erb"))
    result = template.result_with_hash(booking: self)
    pdf = WickedPdf.new.pdf_from_string(result)

    # Salva il file PDF
    file_path = "#{Rails.root}/public/invoices/booking_#{self.id}_invoice.pdf"
    File.open(file_path, 'wb') do |file|
      file << pdf