app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("name", "email", "encrypted_password", "iva", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "role_id", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "sign_in_count" = ?, "current_sign_in_at" = ?, "last_sign_in_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["sign_in_count", 3], ["current_sign_in_at", "2023-05-02 16:52:06.906608"], ["last_sign_in_at", "2023-05-02 16:51:58.738395"], ["updated_at", "2023-05-02 16:52:06.907219"], ["id", 3]]
---
    def facebook
    # You need to implement the method below in your model (e.g. app/models/user.rb)
    @user = User.from_omniauth(request.env["omniauth.auth"])
    if @user.persisted?
    @user.skip_confirmation!
    @user.save