app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("name", "email", "encrypted_password", "iva", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "role_id", "provider", "uid", "city_id", "stripe_account_id", "lat", "long") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
      if params[:user][:role_id]=="10"

        anno, mese, giorno = params[:nascita].split('-').map(&:to_i)

      begin
        stripe_account = Stripe::Account.create({
          type: 'custom',
          country: params[:stato],
          email: params[:user][:email],
          business_type: 'individual',
          individual: {
            email: params[:user][:email],
            first_name: params[:user][:name],
            last_name: params[:cognome],
            address: {
              line1: params[:indirizzo],
              city: params[:citta],
              state: params[:regione],
              postal_code: params[:codicepostale],
              country: params[:stato]
            },
            phone: params[:telefono], # Numero di telefono
            dob: {
              day: giorno, # Giorno di nascita
              month: mese, # Mese di nascita
              year: anno # Anno di nascita

UPDATE "users" SET "remember_created_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_created_at", "2023-05-09 18:32:50.827536"], ["updated_at", "2023-05-09 18:32:50.828049"], ["id", 5]]
---
        bacheca_guida = BachecaGuida.new
        bacheca_guida.user_id = resource.id
        bacheca_guida.save
        resource.save