app/controllers/users/sessions_controller.rb

  def create
    self.resource = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "sue@example.com"], ["LIMIT", 1]]