app/controllers/users/sessions_controller.rb

UPDATE "users" SET "remember_created_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_created_at", nil], ["updated_at", "2023-05-10 10:54:42.317581"], ["id", 4]]
---
  def set_user_online
    current_user.update(online: true)